app/controllers/orders_controller.rb

  def index
    @orders = Order.all
---
SELECT * FROM "orders"

  def update
    admin_user = User.last
    order = Order.find(params[:id])
    order.admin_id = admin_user.id
    order.status = 'completed'
    order.paid_at = Time.now unless order.paid?
    if order.save
---
SELECT * FROM "users" ORDER BY users.id DESC LIMIT 1
SELECT * FROM "orders" WHERE ("orders"."id" = 9)
UPDATE "orders" SET "updated_at" = '2010-04-19 20:31:19', "status" = 'completed', "paid_at" = '2010-04-19 20:31:19', "admin_id" = 2 WHERE "id" = 11