app/controllers/products_controller.rb

INSERT INTO "products" ("name", "price", "created_at", "updated_at", "description", "active") VALUES('PS3', 3000.0, '2010-04-19 15:09:05', '2010-04-19 15:09:05', 'Video Game Legal!', 't')
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save