app/controllers/shop_controller.rb

  def checkout
    current_user = User.first
    @product = Product.find(params[:id])
    ikwa_order = Order.create :user => current_user,
                              :product => @product,
                              :admin_id => Order::UPDATE_USER["SYSTEM"],
                              :status => PagSeguro::Notification::STATUS.index(:pending),
                              :price => @product.price
---
SELECT * FROM "users" LIMIT 1
SELECT * FROM "products" WHERE ("products"."id" = 4)
INSERT INTO "orders" ("price", "created_at", "product_id", "updated_at", "admin_id", "user_id", "processed_at", "paid_at", "status", "payment_type") VALUES(3000.0, '2010-04-19 16:59:40', 1, '2010-04-19 16:59:40', 0, 1, NULL, NULL, 'pending', NULL)

  def confirm
    return unless request.post?

    pagseguro_notification do |notification|
      if notification.valid?
        order = Order.find(notification.params['Referencia'])
        order.status = Iconv.new('ISO-8859-1','UTF-8').iconv(notification.params['StatusTransacao'])
        order.processed_at = notification.processed_at
        order.payment_type = Iconv.new('ISO-8859-1','UTF-8').iconv(notification.params['TipoPagamento'])
        order.paid_at = Time.now if notification.status.to_s == 'completed' or notification.status.to_s == 'approved'
        order.save
---
SELECT * FROM "orders" WHERE ("orders"."id" = 7)
UPDATE "orders" SET "updated_at" = '2010-04-20 12:56:32', "payment_type" = 'Cartão de Crédito', "processed_at" = '2010-04-20 12:56:32', "status" = 'Em Análise' WHERE "id" = 12